app/views/definitions/index.html.erb

SELECT "definitions".* FROM "definitions"
---
    <h4>Search results for <%= @search %></h4>
    <h5>Found <%= pluralize(@definitions.count, "definition") %></h5>