app/controllers/definitions_controller.rb

  def index
    @definitions = Definition.all
---
SELECT "definitions".* FROM "definitions"

  def create
    @definition = Definition.new(definition_params)

    respond_to do |format|
      if @definition.save
---
INSERT INTO "definitions" ("word", "meaning", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["word", "byron"], ["meaning", "is awesome"], ["created_at", "2015-09-30 15:45:39.707908"], ["updated_at", "2015-09-30 15:45:39.707908"]]

  def destroy
    @definition.destroy
---
DELETE FROM "definitions" WHERE "definitions"."id" = ?  [["id", 2]]

    def set_definition
      @definition = Definition.find(params[:id])
---
SELECT  "definitions".* FROM "definitions" WHERE "definitions"."id" = ? LIMIT 1  [["id", 2]]